artillery/grades-load-test.yml
config:
  target: "http://localhost:3000/api"
  phases:
    - duration: 30
      arrivalRate: 50
  defaults:
    headers:
      Content-Type: application/json
scenarios:
  - name: "Grades API"
    flow:
      - post:
          url: "/grades/average"
          json:
            grades: [7.5, 8.0, 9.2]
      - post:
          url: "/grades/weighted-average"
          json:
            grades: [7.5, 8.0, 9.2]
            weights: [1, 2, 3]
      - post:
          url: "/grades/highest"
          json:
            grades: [6.1, 9.9, 8.4]
      - post:
          url: "/grades/lowest"
          json:
            grades: [6.1, 9.9, 8.4]